export default {
    "你好，我叫夜鹰！": {
        select: [
            "夜鹰？",
            "你好，很高兴认识你！"
        ]
    },
    "夜鹰？": {
        answer: [
            "是的，比真名好记！"
        ],
        select: [
            "好吧!"
        ]
    },
    "好吧!": {
        answer: [
            "想聊点什么？"
        ],
        select: [
            "从爱好聊起吧！",
            "嗯，说说你的教育经历吧！"
        ]
    },
    "你好，很高兴认识你！": {
        answer: [
            "我也是", 
            "想聊些什么呢？"
        ],
        select: [
            "从爱好聊起吧！"
        ]
    },
    "从爱好聊起吧！": {
        answer: [
            "好吧，我以为你会从理想开始聊呢！", 
            "我的爱好么……", 
            "看看书，追追剧，写写文章，练练拳", 
            "总结来看，好像都是喜欢别人不喜欢的"
        ],
        select: [
            "那我们还是聊理想吧！", 
            "什么？练拳？"
        ]
    },
    "那我们还是聊理想吧！": {
        answer: [
            "理想吗？我小时候的理想是成为一名杀手！",
            "现在是希望能成为一名卓越的程序员！"
        ],
        select: [
            "……",
            "你的特长是把天聊死吧？"
        ]
    },
    "……": {
        answer: [
            "OK, 那就聊其他的。"
        ],
        select: [
            "嗯，说说你的教育经历吧！"
        ]
    },
    "什么？练拳？": {
        answer: [
            "是的，我花在武术上的时间超过一万小时哦，这是我最精通的本领。我骄傲！"
        ],
        select: [
            "那你一个能打几个？",
            "你……你到底哪来的？"
        ]
    },
    "那你一个能打几个？": {
        answer: [
            "应该……没叶问多",
            "吧……"
        ],
        select: [
            "哦，好吧！"
        ]
    },
    "你的特长是把天聊死吧？": {
        answer: [
            "OK, 那就聊其他的。"
        ],
        select: [
            "嗯，说说你的教育经历吧！"
        ]
    },
    "你……你到底哪来的？": {
        answer: [
            "我吗？",
            "户籍山西省，生于广东茂名，初一那年的寒假，来过一次珠海，很喜欢这里，于是大学毕业后铁了心来这里工作，前两年在坦洲买了房，在卖房之前，我应该都会住在这里。"
        ],
        select: [
            "那你是在哪毕业的？",
        ]
    },
    "那你是在哪毕业的？": {
        answer: [
            "我高中是文科，大学也是在茂名读的，大专，读理科，化学系，后来自学的编程。",
            "选化学系是因为当时不知道自己想做什么，于是听了父母的话，在那个学校读化学系，毕业之后可以安排进当地国企，确实是一条不错的路。",
            "但是后来发觉自己喜欢上了编程，于是开始旷课泡图书馆。"
        ],
        select: [
            "有勇气！",
        ]
    },
    "嗯，说说你的教育经历吧！": {
        answer: [
            "我高中是文科，大学也是在茂名读的，大专，读理科，化学系，后来自学的编程。",
            "选化学系是因为当时不知道自己想做什么，于是听了父母的话，在那个学校读化学系，毕业之后可以安排进当地国企，确实是一条不错的路。",
            "但是后来发觉自己喜欢上了编程，于是开始旷课泡图书馆。"
        ],
        select: [
            "有勇气！",
        ]
    },
    "有勇气！" : {
        answer: [
            "嘻嘻"
        ],
        select: [
            "有勇气！",
        ]
    }
}